/* button in progress sheet */
"Stop" = "Seis";

/* menu item */
"Update iPod" = "Päivitä iPod";

/* Restore iPod command key */
"R" = "R";

/* menu item */
"Restore iPod" = "Palauta iPod";

/* menu item */
"Close Window" = "Sulje ikkuna";

/* menu item */
"About iPod Updater" = "Tietoja - iPod-päivittäjä";

/* Quit command key */
"Q" = "Q";

/* menu title */
"Options" = "Valinnat";

/* menu item */
"Quit" = "Lopeta";

/* Close Window command key */
"W" = "W";

/* text next to lock when unlocking */
"Authenticating..." = "Autentikoidaan...";

/* text next to lock when locked */
"Click the lock to make changes." = "Osoita lukkoa tehdäksesi muutoksia.";

/* text next to lock when unlocked */
"Click the lock to prevent further changes." = "Osoita lukkoa estääksesi muutokset.";

/* detail of error message */
"The iPod Updater application may be damaged." = "iPod-päivitin voi olla vahingoittunut.";

/* error message */
"Out of memory." = "Muisti loppu.";

/* detail of error message, part in <> is replaced and should not be translated) */
"The Mac OS error code was <error>." = "Mac OS -virhekoodi on <error>.";

/* error message */
"Could not find updater library." = "Päivittäjäkirjastoa ei löytynyt.";

/* error message */
"An unexpected error occurred." = "Tapahtui odottamaton virhe.";

/* error message */
"The iPod Updater requires CarbonLib 1.4 or newer." = "iPod-päivittäjä tarvitsee CarbonLib 1.4:n tai uudemman.";

/* main window message */
"Plug in an iPod to update it." = "Liitä iPod sen päivittämiseksi.";

/* error message */
"An error occurred. There may be open files on the iPod." = "Tapahtui virhe. iPodissa voi olla tiedostoja avoinna.";

/* error message */
"The iPod is not mounted." = "iPod ei ole työpöydällä.";

/* detail of confirmation message */
"If you quit while an operation is in progress, you may need to restore the iPod software later." = "Jos lopetat kun jokin toiminto on kesken, voi olla tarpeen palauttaa iPodin ohjelmisto myöhemmin.";

/* info window version */
"<version> (up to date)" = "<version> (ei tarvitse päivitystä)";

/* info window label */
"Software Version:" = "Ohjelmistoversio:";

/* confirmation dialog title */
"Quit" = "Lopeta";

/* message for main window */
"Update puts the latest system software on your iPod." = "Päivitys asentaa uusimman käyttöjärjestelmän iPodiin.";

/* error message */
"The updater does not have a volume image." = "Päivittäjällä ei ole taltiokuvausta.";

/* error message */
"The updater does not have a firmware image." = "Päivittäjällä ei ole firmware-kuvausta.";

/* main window message */
"Your iPod has been updated to version <version>. Please unplug and replug the iPod so it can complete the update process." = "iPod on päivitetty versioon <version>. Irrota sen kaapeli ja liitä uudelleen, jotta päivitys saatettaisiin loppuun.";

/* detail of error message */
"Please attach one iPod at a time to be updated." = "Kytke vain yksi iPod kerrallaan päivitettäväksi.";

/* main window message */
"Your iPod has been restored to factory settings. Please unplug and replug the iPod so it can complete the restore process." = "iPod on palautettu tehdasasetuksiin. Irrota sen kaapeli ja liitä uudelleen, jotta palautus saatettaisiin loppuun.";

/* info window label */
"Name:" = "Nimi:";

/* main window message */
"Your iPod has been restored to factory settings. Please eject and then unplug and replug the iPod so it can complete the restore process." = "iPod on palautettu tehdasasetuksiin. Poista se työpöydältä ja irrota sen kaapeli ja liitä uudelleen, jotta palautus saatettaisiin loppuun.";

/* message for main window */
"Restore completely erases your iPod and applies factory settings. Your music and other data will be erased." = "Palautus tyhjentää iPodin kokonaan ja palauttaa tehdasasetukset. Kaikki musiikki ja tallennettu data poistetaan.";

/* confirmation message */
"Are you sure you want to restore the iPod software?" = "Haluatko varmasti palauttaa iPodin ohjelmiston?";

/* progress message */
"Done restoring iPod software" = "iPodin ohjelmisto on palautettu";

/* main window message */
"An iPod is attached, but not mounted on the desktop." = "iPod on liitetty, mutta se ei ole työpöydällä.";

/* error message */
"No iPod is attached." = "Yhtään iPodia ei ole kytketty.";

/* info window version */
"<version> (needs update)" = "<version> (tarvitsee päivityksen)";

/* main window message */
"More than one iPod is attached. Please attach one iPod at a time to be updated." = "Useampia kuin yksi iPod on kytkettynä. Kytke vain yksi iPod kerrallaan päivitettäväksi.";

/* detail of confirmation message */
"All data currently stored on the iPod will be lost." = "Kaikki iPodiin tallennettu data poistetaan.";

/* error message */
"More than one iPod is attached." = "Useampia kuin yksi iPod on kytkettynä.";

/* confirmation message */
"Quit while this operation is in progress?" = "Lopetetaanko toiminnon ollessa kesken?";

/* detail of error message */
"A single iPod was detected, but it must be mounted on the desktop for this operation to work." = "Yksi iPod on tunnistettu, mutta sen on oltava työpöydällä jotta tämä toiminto voitaisiin toteuttaa.";

/* info window label */
"Capacity:" = "Kapasiteetti:";

/* error message */
"The iPod disk does not have the correct structure." = "iPod-levyn rakenne ei ole kelvollinen.";

/* progress message */
"Updating iPod software" = "iPodin ohjelmistoa päivitetään";

/* about window line */
"iPod Software Version <version>" = "iPod-ohjelmiston versio <version>";

/* progress message */
"Done updating iPod software" = "iPodin ohjelmisto on päivitetty";

/* main window message */
"The attached iPod does not have proper software on it." = "Kytketyssä iPodissa ei ole oikeaa ohjelmistoa.";

/* button for main window */
"Update" = "Päivitä";

/* error message */
"The iPod could not be unmounted because it is in use." = "iPodia ei voitu poistaa työpöydältä, koska se on käytössä.";

/* confirmation dialog title
   button for main window */
"Restore" = "Palauta";

/* error message */
"Could not find a SysInfo file on the iPod disk." = "iPodin levyltä ei löytynyt SysInfo-tiedostoa.";

/* info window label */
"Serial Number:" = "Sarjanumero:";

/* main window title */
"iPod Software <version> Updater" = "iPod-ohjelmiston <version> päivittäjä";

/* main window message */
"Your iPod has been updated to version <version>. Please eject and then unplug and replug the iPod so it can complete the update process." = "iPod on päivitetty versioon <version>. Poista se työpöydältä ja irroita ja liitä takaisin sen kaapeli, jotta päivitys saatettaisiin loppuun.";

/* progress message */
"Restoring iPod software" = "Palautetaan iPodin ohjelmistoa";

